# taps
tap "felixkratz/formulae"
tap "homebrew/services"
tap "koekeishiya/formulae"

# brews
## native alternative
brew "eza"      # ls
brew "bat"      # cat
brew "tlrc"     # man
brew "gping"    # ping
brew "btop"     # htop

## tools
brew "scrcpy"
brew "cointop"

## development
brew "neovim"
brew "mise"
brew "d2"

## customization
brew "chezmoi"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"

# cask
## font
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

## messaging
cask "telegram"
cask "whatsapp"

## media
cask "vlc"
cask "tidal"
cask "sonobus"

## development
cask "visual-studio-code"
cask "android-platform-tools"
cask "docker-desktop"
cask "orbstack"
cask "warp"
cask "gcloud-cli"

## customization
cask "alt-tab"
cask "loop"
cask "raycast"
cask "shottr"
cask "unnaturalscrollwheels"

## tools
cask "chatgpt"
cask "jdownloader"
cask "the-unarchiver"
cask "utm"

# other
cask "vivaldi"