# taps
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/services"
tap "koekeishiya/formulae"

# brews
## tools
brew "scrcpy"

## development
brew "d2"
brew "pulumi"
brew "terraform" # tap "hashicorp/tap"

## customization
brew "chezmoi"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"

# cask
## font
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

## messaging
cask "telegram"
cask "whatsapp"

## media
cask "vlc"
cask "tidal"
cask "sonobus"

## development
cask "android-platform-tools"
cask "arduino-ide"
cask "docker-desktop"
cask "orbstack"
cask "warp"

## customization
cask "alt-tab"
cask "loop"
cask "raycast"
cask "shottr"
cask "unnaturalscrollwheels"

## tools
cask "chatgpt"
cask "jdownloader"
cask "the-unarchiver"
cask "utm"

# other
cask "vivaldi"