# ──────────────────────────────
# TAPS
# ──────────────────────────────
tap "felixkratz/formulae"
tap "jesseduffield/lazydocker"
tap "koekeishiya/formulae"
tap "bjarneo/cliamp"

# ──────────────────────────────
# BREWS
# ──────────────────────────────

## Core Tools (native alternatives)
brew "bat"      # cat
brew "btop"     # htop
brew "eza"      # ls
brew "gping"    # ping
brew "tlrc"     # man

## Development
brew "d2"
brew "colima"
brew "docker"
brew "docker-compose"
brew "helm"
brew "lazydocker"
brew "minikube"
brew "mise"
brew "neovim"

## Tools
brew "cointop"
brew "scrcpy"
brew "netcat"
brew "chafa"
brew "pandoc"
brew "glow"

## Customization
brew "chezmoi"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"

## Terminal
brew "antidote"
# brew "fzf"
brew "oh-my-posh"
brew "grc"

## Other
brew "bjarneo/cliamp/cliamp"

# ──────────────────────────────
# CASKS
# ──────────────────────────────

## Development
cask "android-platform-tools"
cask "antigravity"
cask "gcloud-cli"
cask "ghostty"
cask "orbstack"
cask "warp"

## Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

## Messaging
cask "telegram"
cask "whatsapp"

## Media
cask "stremio"
cask "tidal"
cask "vlc"

## Customization
cask "alt-tab"
cask "kiro-cli"
cask "loop"
cask "raycast"
cask "shottr"
# cask "unnaturalscrollwheels" # don't use 1.4.0, install manually 1.3.0 instead  

## Tools
cask "chatgpt"
cask "google-gemini"
cask "jdownloader"
cask "the-unarchiver"
cask "utm"

## Other
cask "vivaldi"
cask "google-chrome"